# Design Option Get Active Design Option Id Method

Source: https://www.revitapidocs.com/2026/d0b47e58-a5fc-9424-a94c-2428b4ec4d16.htm

---

| Design Option Get Active Design Option Id Method |
| --- |

Gets the active design option id for the document.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ElementId GetActiveDesignOptionId(
	Document document
)
```

```
Public Shared Function GetActiveDesignOptionId (
	document As Document
) As ElementId
```

```
public:
static ElementId^ GetActiveDesignOptionId(
	Document^ document
)
```

```
static member GetActiveDesignOptionId :
        document : Document -> ElementId
```

#### Parameters

document Document
:   The document.

#### Return Value

ElementId
The active design option id. It can be invalid id if there is no active design option in the document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

DesignOption Class Autodesk.Revit.DB Namespace